raceTest/Setup/Deep/impulse/constant/waveDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Type		"velocityseries"

WaveHeight 	0.2;
imposedVel	1.7;
Period 		2.0;
waterLevel	2.5;
direction       (1 0 0);
//Area		0.161;
init       "false";
// ************************************************************************* //
