raceTest/Setup/Deep/impulse/system/funkySetFieldsDict
FoamFile
{
    version         2.0;
    format          ascii;

    root            "/.automount/werner/Werner/bgschaid/bgschaid-foamStuff/DepositionTests";
    case            "";
    instance        "system";
    local           "";

    class           dictionary;
    object          funkySetFieldsDict;
}

expressions
(
		sand0
	{
		field sand;
		expression "-2*10*pow((0-(pos().x))/100,3)+3*10*pow((0-pos().x)/100,2)";		
		condition "pos().x > -100 && pos().x < 0 ";
	}
	
		sand2
	{
		field sand;
                expression "-2*5/pow((200),3)*pow((pos().x-200),3)+3*5/pow((200),2)*pow((pos().x-200),2)";
		condition "pos().x > 200 && pos().x < 400 ";
	}
	
);
