raceTest/Setup/Deep/impulse/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box (-25 -999 -70) (0 999 1);
        fieldValues
        (
            volScalarFieldValue relax 1
        );
    }
    boxToCell
    {
        box (-999. -999. -70.) (9999. 999. 0);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
 );


// ************************************************************************* //
